nixidee/ESP32-Soiltest/Claude/src/main.cpp
/**
 * ESP32-C6 Zigbee Environmental Sensor with Deep Sleep
 * 
 * Hardware: FireBeetle 2 ESP32-C6
 * Sensors: AZ Delivery Bodenfeuchtesensor 1.2, BME280
 * Communication: Zigbee (802.15.4) + Optional WiFi/Webserver
 * 
 * Features:
 * - Zigbee End Device with configurable reporting intervals
 * - Deep Sleep support for battery operation
 * - BME280 temperature, humidity, pressure sensing
 * - Soil moisture sensing with threshold categories
 * - Battery voltage monitoring
 * - Optional WiFi configuration via Zigbee
 * - Optional web server for configuration
 * - Dual-core optimization (LP/HP cores)
 * 
 * @author Assistant
 * @version 1.0
 * @date 2025
 */

#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_BME280.h>
#include <Adafruit_Sensor.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <string.h>
#include <esp_zigbee_core.h>
#include <esp_check.h>
#include <esp_log.h>
#include <nvs_flash.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <esp_sleep.h>
#include <esp_pm.h>
#include <driver/gpio.h>
#include <driver/adc.h>
#include <esp32-hal-adc.h>
#include <esp_adc_cal.h>

// ==================== KONFIGURATION ====================
// Diese Werte können angepasst werden

// Pin-Definitionen (FireBeetle 2 ESP32-C6)
#define SOIL_SENSOR_PIN         4     // GPIO4 (ADC1_CH4) - Bodenfeuchte Analog
#define SOIL_SENSOR_POWER_PIN   5     // GPIO5 - Stromversorgung für Sensor
#define BATTERY_VOLTAGE_PIN     0     // GPIO0 (ADC1_CH0) - Batteriespannung
#define BUTTON_PIN              9     // GPIO9 - BOOT Button
#define LED_PIN                 15    // GPIO15 - Onboard LED
#define BME280_SDA_PIN          19    // GPIO19 - I2C SDA
#define BME280_SCL_PIN          20    // GPIO20 - I2C SCL

// Zigbee Konfiguration
#define ZIGBEE_CHANNEL          11    // Zigbee Kanal (11-26)
#define ZIGBEE_PAN_ID           0x1234 // PAN ID
#define MANUFACTURER_NAME       "DIY_Sensor"
#define MODEL_IDENTIFIER        "ESP32C6_ENV_SENSOR"
#define ENDPOINT_ID             1

// Timing Konfiguration (in Sekunden)
#define DEFAULT_MEASURE_INTERVAL 30   // Standard: alle 30 Sekunden (zum Testen)
#define MIN_MEASURE_INTERVAL     10   // Minimum Intervall
#define MAX_MEASURE_INTERVAL     3600 // Maximum Intervall (1 Stunde)

// Bodenfeuchte Schwellwerte (ADC Werte 0-4095)
#define SOIL_VERY_DRY           3500  // > 3500: Sehr trocken
#define SOIL_DRY                2800  // 2800-3500: Trocken
#define SOIL_NORMAL             2000  // 2000-2800: Normal
#define SOIL_WET                1200  // 1200-2000: Feucht
                                      // < 1200: Zu feucht

// WiFi Standard-Konfiguration
#define DEFAULT_WIFI_SSID       "YourWiFiSSID"
#define DEFAULT_WIFI_PASSWORD   "YourWiFiPassword"

// FireBeetle 2 ESP32-C6 batteriespannungsteiler (R1=100k, R2=100k)
#define VBAT_R1                100000.0f
#define VBAT_R2                100000.0f
#define VBAT_DIVIDER_RATIO     ((VBAT_R1 + VBAT_R2) / VBAT_R2) // 2.0

// ==================== GLOBALE VARIABLEN ====================

static const char *TAG = "ESP32_ZIGBEE_SENSOR";

// Sensor Objekte
Adafruit_BME280 bme;
Preferences preferences;
WebServer *webServer = nullptr;

// Laufzeitkonfiguration
bool enableDeepSleep = false;
bool enableWiFi = false;
bool enableWebServer = false;

// Zigbee Handles
static esp_zb_ep_list_t *esp_zb_ep_list = NULL;
static esp_zb_cluster_list_t *esp_zb_cluster_list = NULL;

// Status Variablen
static bool zigbee_initialized = false;
static bool wifi_enabled = false;
static uint32_t measure_interval = DEFAULT_MEASURE_INTERVAL;
static volatile bool button_pressed = false;

// Sensor Daten Struktur
struct SensorData {
    float temperature;      // °C
    float humidity;         // %
    float pressure;         // hPa
    float abs_humidity;     // g/m³
    float dew_point;        // °C
    uint16_t soil_moisture; // ADC Wert (0-4095)
    uint8_t soil_category;  // 0=sehr trocken, 1=trocken, 2=normal, 3=feucht, 4=zu feucht
    float battery_voltage;  // V
    uint8_t battery_percent; // %
    float charge_voltage;   // V (falls verfügbar)
};

static SensorData current_data;

// Zigbee Attribut für Taupunkt (in 0.01 °C)
static int16_t attr_dewpoint = 0;

// Task Handles für Dual-Core
TaskHandle_t zigbeeTaskHandle = NULL;
TaskHandle_t sensorTaskHandle = NULL;
TaskHandle_t webTaskHandle = NULL;

// ==================== HILFSFUNKTIONEN ====================

/**
 * Berechnet die absolute Luftfeuchtigkeit aus Temperatur und relativer Feuchte
 * @param temp Temperatur in °C
 * @param rel_humidity Relative Luftfeuchtigkeit in %
 * @return Absolute Luftfeuchtigkeit in g/m³
 */
float calculateAbsoluteHumidity(float temp, float rel_humidity) {
    // Magnus-Formel für Sättigungsdampfdruck
    float a = 17.27;
    float b = 237.7;
    float gamma = (a * temp) / (b + temp) + log(rel_humidity / 100.0);
    float dewPoint = (b * gamma) / (a - gamma);

    // Absolute Luftfeuchtigkeit
    float abs_humidity = 216.7 * ((rel_humidity / 100.0) * 6.112 *
                        exp((17.62 * temp) / (243.12 + temp))) / (273.15 + temp);
    return abs_humidity;
}

/**
 * Berechnet den Taupunkt aus Temperatur und relativer Luftfeuchtigkeit
 * @param temperature Temperatur in °C
 * @param humidity Relative Luftfeuchtigkeit in %
 * @return Taupunkt in °C
 */
float calculateDewPoint(float temperature, float humidity) {
    const float a = 17.62f;
    const float b = 243.12f;
    float gamma = (a * temperature) / (b + temperature) + log(humidity / 100.0f);
    return (b * gamma) / (a - gamma);
}

/**
 * Kategorisiert die Bodenfeuchte basierend auf ADC-Wert
 * @param adc_value ADC-Wert (0-4095)
 * @return Kategorie (0-4)
 */
uint8_t categorizeSoilMoisture(uint16_t adc_value) {
    if (adc_value > SOIL_VERY_DRY) return 0;  // Sehr trocken
    if (adc_value > SOIL_DRY) return 1;       // Trocken  
    if (adc_value > SOIL_NORMAL) return 2;    // Normal
    if (adc_value > SOIL_WET) return 3;       // Feucht
    return 4;                                  // Zu feucht
}

/**
 * Konvertiert Bodenfeuchte-Kategorie zu String
 */
const char* soilCategoryToString(uint8_t category) {
    switch(category) {
        case 0: return "Sehr trocken";
        case 1: return "Trocken";
        case 2: return "Normal";
        case 3: return "Feucht";
        case 4: return "Zu feucht";
        default: return "Unbekannt";
    }
}

/**
 * Liest die Batteriespannung mit kalibriertem ADC
 * @return Batteriespannung in V
 */
float readBatteryVoltage() {
    static bool adc_calibrated = false;
    static esp_adc_cal_characteristics_t adc_chars;

    if (!adc_calibrated) {
        analogReadResolution(12);
        analogSetPinAttenuation(BATTERY_VOLTAGE_PIN, ADC_11db);

